# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.
# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

frouts = ['mango', 'apple', 'banana', 'orange']
nom = 0
for frout in frouts:
    nom = nom + 1
    print(nom, '. ','{:>10}'.format(frout), sep='')